; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	thermograph1 - mode
	image2 - mode
	infrared0 - mode
	infrared3 - mode
	image5 - mode
	spectrograph4 - mode
	GroundStation2 - direction
	GroundStation4 - direction
	Star3 - direction
	GroundStation0 - direction
	Star1 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument4 infrared0)
	(supports instrument4 image5)
	(supports instrument4 image2)
	(calibration_target instrument4 Star3)
	(supports instrument5 spectrograph4)
	(supports instrument5 image2)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument6 image5)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 thermograph1)
	(supports instrument7 infrared0)
	(supports instrument7 image2)
	(calibration_target instrument7 Star1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon5)
)
(:goal (and
	(pointing satellite1 Phenomenon11)
	(pointing satellite2 Phenomenon11)
	(pointing satellite3 Phenomenon10)
	(have_image Phenomenon5 thermograph1)
	(have_image Phenomenon5 infrared0)
	(have_image Star6 infrared3)
	(have_image Star7 infrared0)
	(have_image Star7 image5)
	(have_image Phenomenon8 image5)
	(have_image Phenomenon8 infrared3)
	(have_image Planet9 thermograph1)
	(have_image Planet9 infrared0)
	(have_image Phenomenon10 infrared0)
	(have_image Phenomenon11 image5)
))

)

; plan
1. (turn_to satellite3 star1 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 star1)
   goals met: 0 of 14
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 14
3. (calibrate satellite3 instrument7 star1)
   added: (calibrated instrument7)
   goals met: 0 of 14
4. (turn_to satellite3 planet9 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 planet9)
   goals met: 0 of 14
5. (take_image satellite3 planet9 instrument7 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 1 of 14
6. (take_image satellite3 planet9 instrument7 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 2 of 14
7. (turn_to satellite3 phenomenon5 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 phenomenon5)
   goals met: 2 of 14
8. (turn_to satellite2 star3 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star3)
   goals met: 2 of 14
9. (turn_to satellite0 groundstation2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation2)
   goals met: 2 of 14
10. (take_image satellite3 phenomenon5 instrument7 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 3 of 14
11. (take_image satellite3 phenomenon5 instrument7 infrared0)
   added: (have_image phenomenon5 infrared0)
   goals met: 4 of 14
12. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 4 of 14
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 14
14. (calibrate satellite2 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 4 of 14
15. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 4 of 14
16. (turn_to satellite0 phenomenon8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 14
17. (take_image satellite0 phenomenon8 instrument0 infrared3)
   added: (have_image phenomenon8 infrared3)
   goals met: 5 of 14
18. (turn_to satellite0 star6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star6)
   goals met: 5 of 14
19. (take_image satellite0 star6 instrument0 infrared3)
   added: (have_image star6 infrared3)
   goals met: 6 of 14
20. (turn_to satellite1 phenomenon11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon11)
   goals met: 7 of 14
21. (turn_to satellite2 phenomenon8 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon8)
   goals met: 7 of 14
22. (take_image satellite2 phenomenon8 instrument4 image5)
   added: (have_image phenomenon8 image5)
   goals met: 8 of 14
23. (turn_to satellite2 star7 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star7)
   goals met: 8 of 14
24. (take_image satellite2 star7 instrument4 image5)
   added: (have_image star7 image5)
   goals met: 9 of 14
25. (take_image satellite2 star7 instrument4 infrared0)
   added: (have_image star7 infrared0)
   goals met: 10 of 14
26. (turn_to satellite2 phenomenon11 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 phenomenon11)
   goals met: 11 of 14
27. (take_image satellite2 phenomenon11 instrument4 image5)
   added: (have_image phenomenon11 image5)
   goals met: 12 of 14
28. (turn_to satellite3 phenomenon10 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 phenomenon10)
   goals met: 13 of 14
29. (take_image satellite3 phenomenon10 instrument7 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 14 of 14
